//==============================================================================
///
/// @file
/// @brief Программа для робота Карела и стартовая функция
///
//==============================================================================


#include "karel.h"


//==============================================================================
/// Программа для робота Карела
///
void KarelProgram() {
/// @todo Добавить программу для Карела
     Move();
     Move();
     for(int i=0; i<3; i++)
     TurnLeft();
     Move();
     TurnLeft();
     Move();




}


//==============================================================================
/// Стартовая функция
///
int main() {
    LoadWorld("worlds/collect_newspaper.w");
    KarelProgram();
    Finish();
    return 0;
}
